wrk/output/stage_3/2_put_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.324ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.205ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.236ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.246ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms  411.20us  10.02ms   76.03%
    Req/Sec   263.24     51.53   555.00     60.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.50ms
 90.000%    1.70ms
 99.000%    2.15ms
 99.900%    4.77ms
 99.990%    9.84ms
 99.999%   10.02ms
100.000%   10.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.306     0.000000            1         1.00
       0.806     0.100000         2006         1.11
       0.941     0.200000         4010         1.25
       1.047     0.300000         6005         1.43
       1.146     0.400000         8003         1.67
       1.243     0.500000        10003         2.00
       1.295     0.550000        11007         2.22
       1.346     0.600000        12020         2.50
       1.395     0.650000        13010         2.86
       1.445     0.700000        14016         3.33
       1.497     0.750000        14998         4.00
       1.526     0.775000        15503         4.44
       1.554     0.800000        16011         5.00
       1.584     0.825000        16515         5.71
       1.619     0.850000        17013         6.67
       1.654     0.875000        17496         8.00
       1.675     0.887500        17751         8.89
       1.697     0.900000        18005        10.00
       1.718     0.912500        18251        11.43
       1.742     0.925000        18497        13.33
       1.774     0.937500        18751        16.00
       1.790     0.943750        18880        17.78
       1.807     0.950000        19002        20.00
       1.826     0.956250        19125        22.86
       1.848     0.962500        19247        26.67
       1.878     0.968750        19375        32.00
       1.896     0.971875        19435        35.56
       1.914     0.975000        19497        40.00
       1.946     0.978125        19558        45.71
       1.986     0.981250        19622        53.33
       2.017     0.984375        19683        64.00
       2.044     0.985938        19714        71.11
       2.071     0.987500        19746        80.00
       2.117     0.989062        19777        91.43
       2.169     0.990625        19810       106.67
       2.245     0.992188        19839       128.00
       2.295     0.992969        19855       142.22
       2.351     0.993750        19872       160.00
       2.423     0.994531        19886       182.86
       2.557     0.995313        19902       213.33
       2.691     0.996094        19917       256.00
       2.861     0.996484        19925       284.44
       2.989     0.996875        19933       320.00
       3.229     0.997266        19941       365.71
       3.531     0.997656        19949       426.67
       3.797     0.998047        19956       512.00
       3.933     0.998242        19960       568.89
       4.279     0.998437        19964       640.00
       4.571     0.998633        19968       731.43
       4.691     0.998828        19972       853.33
       5.103     0.999023        19976      1024.00
       5.331     0.999121        19978      1137.78
       5.587     0.999219        19980      1280.00
       5.915     0.999316        19982      1462.86
       6.187     0.999414        19984      1706.67
       6.347     0.999512        19986      2048.00
       6.351     0.999561        19987      2275.56
       7.067     0.999609        19988      2560.00
       8.011     0.999658        19989      2925.71
       8.223     0.999707        19990      3413.33
       8.231     0.999756        19991      4096.00
       8.231     0.999780        19991      4551.11
       8.527     0.999805        19992      5120.00
       8.527     0.999829        19992      5851.43
       9.839     0.999854        19993      6826.67
       9.839     0.999878        19993      8192.00
       9.839     0.999890        19993      9102.22
       9.951     0.999902        19994     10240.00
       9.951     0.999915        19994     11702.86
       9.951     0.999927        19994     13653.33
       9.951     0.999939        19994     16384.00
       9.951     0.999945        19994     18204.44
      10.023     0.999951        19995     20480.00
      10.023     1.000000        19995          inf
#[Mean    =        1.260, StdDeviation   =        0.411]
#[Max     =       10.016, Total count    =        19995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30003 requests in 30.00s, 1.92MB read
Requests/sec:   1000.06
Transfer/sec:     65.43KB