wrk/output/stage_3/3_get_full_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.341ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.315ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.341ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.337ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.37ms  450.58us  10.10ms   76.95%
    Req/Sec   263.69     52.66   555.00     59.27%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    1.63ms
 90.000%    1.83ms
 99.000%    2.18ms
 99.900%    6.41ms
 99.990%    8.85ms
 99.999%   10.11ms
100.000%   10.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.296     0.000000            1         1.00
       0.880     0.100000         2015         1.11
       1.024     0.200000         4007         1.25
       1.136     0.300000         6006         1.43
       1.241     0.400000         8001         1.67
       1.357     0.500000         9999         2.00
       1.413     0.550000        10998         2.22
       1.471     0.600000        12015         2.50
       1.520     0.650000        12998         2.86
       1.573     0.700000        14002         3.33
       1.630     0.750000        14997         4.00
       1.661     0.775000        15507         4.44
       1.692     0.800000        15998         5.00
       1.725     0.825000        16504         5.71
       1.758     0.850000        17001         6.67
       1.795     0.875000        17506         8.00
       1.811     0.887500        17753         8.89
       1.831     0.900000        18004        10.00
       1.852     0.912500        18256        11.43
       1.876     0.925000        18504        13.33
       1.901     0.937500        18757        16.00
       1.917     0.943750        18880        17.78
       1.932     0.950000        18998        20.00
       1.949     0.956250        19127        22.86
       1.968     0.962500        19255        26.67
       1.989     0.968750        19373        32.00
       2.004     0.971875        19435        35.56
       2.020     0.975000        19498        40.00
       2.039     0.978125        19559        45.71
       2.065     0.981250        19621        53.33
       2.095     0.984375        19683        64.00
       2.113     0.985938        19715        71.11
       2.135     0.987500        19746        80.00
       2.161     0.989062        19778        91.43
       2.203     0.990625        19809       106.67
       2.253     0.992188        19839       128.00
       2.313     0.992969        19855       142.22
       2.415     0.993750        19872       160.00
       2.661     0.994531        19886       182.86
       2.925     0.995313        19902       213.33
       3.295     0.996094        19917       256.00
       3.415     0.996484        19925       284.44
       3.695     0.996875        19933       320.00
       4.035     0.997266        19941       365.71
       4.359     0.997656        19949       426.67
       4.671     0.998047        19956       512.00
       5.035     0.998242        19960       568.89
       5.343     0.998437        19964       640.00
       5.879     0.998633        19968       731.43
       6.151     0.998828        19972       853.33
       6.483     0.999023        19976      1024.00
       6.555     0.999121        19978      1137.78
       6.815     0.999219        19980      1280.00
       6.915     0.999316        19982      1462.86
       7.431     0.999414        19984      1706.67
       7.551     0.999512        19986      2048.00
       7.671     0.999561        19987      2275.56
       7.943     0.999609        19988      2560.00
       7.983     0.999658        19989      2925.71
       8.207     0.999707        19990      3413.33
       8.559     0.999756        19991      4096.00
       8.559     0.999780        19991      4551.11
       8.583     0.999805        19992      5120.00
       8.583     0.999829        19992      5851.43
       8.855     0.999854        19993      6826.67
       8.855     0.999878        19993      8192.00
       8.855     0.999890        19993      9102.22
       9.591     0.999902        19994     10240.00
       9.591     0.999915        19994     11702.86
       9.591     0.999927        19994     13653.33
       9.591     0.999939        19994     16384.00
       9.591     0.999945        19994     18204.44
      10.111     0.999951        19995     20480.00
      10.111     1.000000        19995          inf
#[Mean    =        1.370, StdDeviation   =        0.451]
#[Max     =       10.104, Total count    =        19995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 30.00s, 2.03MB read
Requests/sec:   1000.09
Transfer/sec:     69.20KB