wrk/output/stage_3/4_delete_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.257ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.206ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.241ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.289ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27ms  409.76us   8.30ms   72.46%
    Req/Sec   263.18     50.23   500.00     65.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.53ms
 90.000%    1.74ms
 99.000%    2.10ms
 99.900%    4.80ms
 99.990%    8.15ms
 99.999%    8.30ms
100.000%    8.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.273     0.000000            1         1.00
       0.790     0.100000         2001         1.11
       0.944     0.200000         4008         1.25
       1.065     0.300000         6012         1.43
       1.163     0.400000         8000         1.67
       1.243     0.500000        10001         2.00
       1.289     0.550000        11002         2.22
       1.340     0.600000        12005         2.50
       1.400     0.650000        13013         2.86
       1.464     0.700000        14004         3.33
       1.528     0.750000        15002         4.00
       1.559     0.775000        15498         4.44
       1.593     0.800000        16005         5.00
       1.629     0.825000        16506         5.71
       1.663     0.850000        16996         6.67
       1.702     0.875000        17511         8.00
       1.722     0.887500        17749         8.89
       1.744     0.900000        18000        10.00
       1.767     0.912500        18248        11.43
       1.795     0.925000        18497        13.33
       1.823     0.937500        18747        16.00
       1.840     0.943750        18877        17.78
       1.860     0.950000        19002        20.00
       1.877     0.956250        19123        22.86
       1.897     0.962500        19248        26.67
       1.924     0.968750        19376        32.00
       1.937     0.971875        19439        35.56
       1.948     0.975000        19496        40.00
       1.966     0.978125        19559        45.71
       1.984     0.981250        19623        53.33
       2.011     0.984375        19683        64.00
       2.030     0.985938        19717        71.11
       2.051     0.987500        19746        80.00
       2.075     0.989062        19778        91.43
       2.111     0.990625        19809       106.67
       2.179     0.992188        19839       128.00
       2.241     0.992969        19855       142.22
       2.329     0.993750        19871       160.00
       2.445     0.994531        19886       182.86
       2.557     0.995313        19902       213.33
       2.691     0.996094        19917       256.00
       2.843     0.996484        19925       284.44
       2.985     0.996875        19933       320.00
       3.139     0.997266        19941       365.71
       3.337     0.997656        19949       426.67
       3.569     0.998047        19956       512.00
       3.821     0.998242        19960       568.89
       3.889     0.998437        19964       640.00
       3.979     0.998633        19968       731.43
       4.519     0.998828        19972       853.33
       4.807     0.999023        19976      1024.00
       5.123     0.999121        19978      1137.78
       5.263     0.999219        19980      1280.00
       5.275     0.999316        19982      1462.86
       5.771     0.999414        19984      1706.67
       5.907     0.999512        19986      2048.00
       6.267     0.999561        19987      2275.56
       6.359     0.999609        19988      2560.00
       6.459     0.999658        19989      2925.71
       6.563     0.999707        19990      3413.33
       7.043     0.999756        19991      4096.00
       7.043     0.999780        19991      4551.11
       7.679     0.999805        19992      5120.00
       7.679     0.999829        19992      5851.43
       8.147     0.999854        19993      6826.67
       8.147     0.999878        19993      8192.00
       8.147     0.999890        19993      9102.22
       8.231     0.999902        19994     10240.00
       8.231     0.999915        19994     11702.86
       8.231     0.999927        19994     13653.33
       8.231     0.999939        19994     16384.00
       8.231     0.999945        19994     18204.44
       8.303     0.999951        19995     20480.00
       8.303     1.000000        19995          inf
#[Mean    =        1.271, StdDeviation   =        0.410]
#[Max     =        8.296, Total count    =        19995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30003 requests in 30.00s, 1.95MB read
Requests/sec:   1000.07
Transfer/sec:     66.41KB